# RoomNotEnclosedRooms Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomNotEnclosedRooms Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] is not in a properly enclosed region
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomNotEnclosedRooms { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomNotEnclosedRooms As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomNotEnclosedRooms {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace